// console.log(`Оценка за задание 100 баллов\n
// 1. Вёрстка валидная +10\n
// 2. Вёрстка семантическая +16
// В коде страницы присутствуют следующие элементы (указано минимальное количество, может быть больше):
//  - <header>, <main>, <footer> +2.
//  - шесть элементов <section> (по количеству секций) +2.
//  - только один заголовок <h1> +2.
//  - пять заголовков <h2> (легко отличимы на верхних границах секций, имеют единый стиль) +2.
//  - один элемент <nav> (панель навигации в хедере) +2.
//  - два списка ul > li > a (панель навигации, ссылки на соцсети в футере) +2.
//  - семь кнопок <button> +2.
//  - два инпута <input> +2.\n
// 3. Вёрстка соответствует макету +54
//  - блок <header> +8.
//  - секция Welcome +4.
//  - секция About +6.
//  - секция Favorites +8.
//  - секция CoffeShop +6.
//  - секция Contacts +6.
//  - секция LibraryCard +8.
//  - блок <footer> +8:\n
//  4. Общие требования к верстке +20
//  - для построения сетки используются флексы или гриды (display: flex... или display: grid...) +2.
//  - при уменьшении масштаба страницы браузера вся вёрстка (контент и фоны) размещается по центру, а не сдвигается в сторону +2.
//  - иконки добавлены в формате .svg. +2.
//  - изображения добавлены в формате .jpg (.jpeg) или .png +2.
//  - есть favicon +2.
//  - плавная прокрутка по якорям +2.
//  - в футере название ссылки Username заменено и ведет на GitHub студента +2.
//  - в футере ссылка The Rolling Scopes School ведет на страницу курса https://rs.school/js-stage0/ +2.
//  - интерактивность элементов согласно макету +2.
//  - обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияет на соседние элементы +2.`);

//  console.log(`Оценка за задание 50 баллов\n
// 1. Вёрстка соответствует макету. Ширина экрана 768px +26
//   - блок <header> +2
//   - секция Welcome +2
//   - секция About +4. - Обратите внимание на появление новых элементов в виде стрелок и переход на 5 точек вместо 3х. - Не нужно менять расстояние от картинки до точек, нужно оставить 40px. Оценку не снижаем, если сделано по макету (25px).
//   - секция Favorites +2 - Сделать кнопку own, вместо buy для последней книги. Здесь важно будет соблюсти условие, что, какие кнопки находились в состояние "own" на Desktop, те же кнопки в том же состоянии будут и на Tablet. Если условие соблюдено: +2
//   - секция CoffeShop +4 - Оценка снижаться не будет, если при наложении текста, не будет совпадать расположение букв, расстояние между символами, начало и конец строки, а так же орфография. Будут оцениваться межстрочный интервал, шрифт и центрирование блока с текстом по общим правилам.
//   - секция Contacts +4
//   - секция LibraryCard +4
//   - блок <footer> + 2
// 2. Ни на одном из разрешений до 640px включительно не появляется горизонтальная полоса прокрутки. Весь контент страницы при этом сохраняется: не обрезается и не удаляется +12
//   - нет полосы прокрутки при ширине страницы от 1440рх до 640рх +4.
//   - элементы не выходят за пределы окна браузера при ширине страницы от 1440рх до 640рх +4.
//   - элементы не наезжают друг на друга при ширине страницы от 1440рх до 640рх +4. Например, меню в хедере должно преобразоваться в бургер-меню до того, как элементы начнут наезжать друг на друга.
//   - все что будет происходить на ширине свыше 1440px - не оценивается. Поэтому можно либо растягивать на весь экран, либо оставить центральной колонкой.
// 3. На ширине экрана 768рх реализовано адаптивное меню +12 (Рекомендуется сделать появление бургер-меню на ширине 1024px): Eсли при ширине страницы в 768рх панель навигации не скрыта, а бургер-иконка не появилась (при этом учитывайте "Особенности проверки адаптивности в DevTools"), то ставим 0 за данный пункт, и дальше его не проверяем. Иначе: - Версия Tablet, отступ иконки юзера от правого края - 105px. Такое же расстояние надо сделать и у открытого меню (сейчас там 92px). Сам крест желательно отцентрировать по поцентральной позиции бургер-иконки. Чтобы при переходе из одного состояния в другое ничего не прыгало. Само меню нужно прижать к правому краю целиком. Если иконка юзера не прыгает (не меняет позиции при открытии меню), независимо от величины отступа: +2 - Цвет выпавшего меню должен совпадать с цветом полоски навигации. Оценка снижаться не будет, если сделано по первому макету (#000000).
//   - при нажатии на бургер-иконку плавно появляется адаптивное меню +4
//   - при нажатии на крестик, или на область вне меню, адаптивное меню плавно скрывается, уезжая за экран +2
//   - ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям при нажатии, а само адаптивное меню при этом плавно скрывается +2
//   - размеры открытого бургер-меню соответствуют макету, так же открытое бургер-меню проверяется на PixelPerfect +2
// `);

console.log('Оценка за задание 200 баллов');
